ams/src/Documents/AMS_ПроизводствоФабриката/AMS_ПроизводствоФабриката.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ПроизводствоФабриката</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Фабрикаты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef._ВариантыСпецификацийНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыФабриката</name>
    <attributes>
      <name>Фабрикат</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Catalogs/_ВариантыСпецификацийНоменклатуры/_ВариантыСпецификацийНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>_ВариантыСпецификацийНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаЗамес</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаУпаковку</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереработкаБрака</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

ams/src/Documents/AMS_ПроизводствоФабриката/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ПолучитьДокументыПроизводстваФабриката();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФабрикаты

&НаКлиенте
Процедура ФабрикатыПриИзменении(Элемент)
	Стр = Элементы.Фабрикаты.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Стр.Номенклатура) И ЗначениеЗаполнено(Стр.Спецификация) И Стр.Количество > 0 Тогда
		ЗаполнитьТоварыПоСпецификации();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПроизводства

&НаКлиенте
Процедура ДокументыПроизводстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Стр = Элемент.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(, Стр.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПроизводстваПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ДокументыПроизводстваПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТоварыПоСпецификации()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фабрикаты", Объект.Фабрикаты.Выгрузить());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.Количество КАК КоличествоФабриката
	|ПОМЕСТИТЬ Фабрикаты
	|ИЗ
	|	&Фабрикаты КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Фабрикаты.Номенклатура КАК Фабрикат,
	|	Фабрикаты.КоличествоФабриката КАК КоличествоФабриката,
	|	СпецТовары.Номенклатура КАК Номенклатура,
	|	СпецТовары.Количество * Фабрикаты.КоличествоФабриката / СпецТовары.Ссылка.Количество КАК КоличествоМатериала
	|ПОМЕСТИТЬ Материалы
	|ИЗ
	|	Фабрикаты КАК Фабрикаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТовары
	|		ПО Фабрикаты.Спецификация = СпецТовары.Ссылка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Материалы.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Закупки.Период) КАК Период
	|ПОМЕСТИТЬ ПоследЗакупка
	|ИЗ
	|	Материалы КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки КАК Закупки
	|		ПО Материалы.Номенклатура = Закупки.АналитикаУчетаНоменклатуры.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	Материалы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследЗакупка.Номенклатура КАК Номенклатура,
	|	Закупки.Сумма / Закупки.Количество КАК Цена
	|ПОМЕСТИТЬ ЦеныМат
	|ИЗ
	|	ПоследЗакупка КАК ПоследЗакупка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки КАК Закупки
	|		ПО ПоследЗакупка.Номенклатура = Закупки.АналитикаУчетаНоменклатуры.Номенклатура
	|		И ПоследЗакупка.Период = Закупки.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Материалы.Фабрикат КАК Фабрикат,
	|	СУММА(ЦеныМат.Цена * Материалы.КоличествоМатериала) КАК СуммаМатериала
	|ПОМЕСТИТЬ СуммаМат
	|ИЗ
	|	Материалы КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныМат КАК ЦеныМат
	|		ПО Материалы.Номенклатура = ЦеныМат.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	Материалы.Фабрикат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Фабрикаты.Номенклатура КАК Номенклатура,
	|	Фабрикаты.Спецификация КАК Спецификация,
	|	Фабрикаты.КоличествоФабриката КАК Количество,
	|	СуммаМат.СуммаМатериала / Фабрикаты.КоличествоФабриката КАК Цена
	|ИЗ
	|	Фабрикаты КАК Фабрикаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаМат КАК СуммаМат
	|		ПО Фабрикаты.Номенклатура = СуммаМат.Фабрикат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Материалы.Фабрикат КАК Фабрикат,
	|	Материалы.Номенклатура КАК Номенклатура,
	|	Материалы.КоличествоМатериала КАК Количество,
	|	ЦеныМат.Цена КАК Цена
	|ИЗ
	|	Материалы КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныМат КАК ЦеныМат
	|		ПО Материалы.Номенклатура = ЦеныМат.Номенклатура";
	
	Пакет = Запрос.ВыполнитьПакет();
	Объект.Фабрикаты.Загрузить(Пакет[5].Выгрузить());
	Объект.МатериалыФабриката.Загрузить(Пакет[6].Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ПолучитьДокументыПроизводстваФабриката()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Табл = AMS_Сервер.ПолучитьДокументыПроизводстваФабриката(Объект.Ссылка);
		ДокументыПроизводства.Загрузить(Табл);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПроизводстваПриАктивизацииСтрокиОбработчикОжидания()
	ТекущиеДанные = Элементы.ДокументыПроизводства.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьТоварыДокументыПроизводства(ТекущиеДанные.Ссылка, ТекущиеДанные.Операция);
КонецПроцедуры

&НаСервере
Процедура ПоказатьТоварыДокументыПроизводства(Ссылка, Операция)
	ИмяСсылка = Ссылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Номенклатура.ЕдиницаИзмерения КАК Ед,
	|	т.Количество КАК Количество,
	|	т.Количество / т.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА т.Номенклатура._Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА т.Номенклатура.ЕдиницаДляОтчетов
	|		ИНАЧЕ т.Номенклатура._Упаковка
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	Документ." + ИмяСсылка + ".Товары КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка"; 
	
	ДокументыПроизводстваТовары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти
